def _02_01():
    '''
    1. Парні
Дано стрічка, яка складається з символів і/або послідовностей символів, розділених прога-
линами. Потрібно повернути стрічку, що містить тільки парні елементи з почткової стрічки.
Наприклад, з ’a b c d e f’ отримається ’b d f’. Вирішіть задачу в одну стрічку використовуючи
зрізи.'''
    s = 'a bb ccc dddd ee f'
    s = 'a b c d e f'
    ss = s[::2]
    print(ss)
    print('isn\'t solved')

def _02_02():
    '''
2. Навпаки
Данострічка,щоскладаєтьсязсимволіві/абопослідовностейсимволів,розділенихпрогали-
нами. Потрібно повернути стрічку, що містить елементи початкової стрічки у зворотньому
порядку. Наприклад, із ’a b c d e’ отримується ’e d c b a’. Вирішіть задачу в одну стрічку
використовуючи зрізи.
    '''
    s = 'a b c d e f'
    print(s[::-1])

def _02_03():
        '''
3. Зсув
Данострічка,щоскладаєтьсязсимволіві/абопослідовностейсимволів,розділенихпрогали-
нами. Потрібно повернути стрічку, в якій останній елемент знаходиться на першому місці.
Наприклад, із ’a b c d e f’ отримається ’f a b c d e’. Вирішіть задачу в дві стрічки використо-
вуючи зрізи.

        '''
        s = 'a b c d e f'
        print('ss =',s[::-1])


def _02_04():
    '''4. Паліндром
Дано число. потрібно визначити чи є воно паліндромом. Число є паліндромом якщо воно
однаковочитаєтьсявобохнапрямках.Вирішітьзадачуводнустрічкувикористовуючизрізи.'''
    s = 1234567890987654321
    #s = 12345678987654321
    s = str(s)
    for s2 in range(len(s)//2):
        print('ітерація', s2, ':', s[s2],'==', s[-s2-1])
        if s[s2] == s[-s2-1]:
            ans = 'є паліндромом'
        else:
            ans ='не є паліндромом'
            break
    print('Задана послідовність', ans)

def _02_05():
    '''
5. В середині
Дано стрічка, що складається з парної кількості символів і/або послідовностей символів,
розділених прогалинами. Виведіть стрічку, в якій перший і останій елементи поставлені в
середину початкової стрічки. Наприклад, із ’a b c d e f’ отримається ’b c a f d e’. Вирішіть
задачу в три стрічки використовуючи зрізи.
'''
    s = 'a b c d e f'
    ss = s[1:int(len(s) / 2)] + ' ' + s[0] + ' ' + s[-1] + s[int(len(s) / 2):-1]
    print(ss)

_02_05()
